backend/views/products/_form.php

            <div class="col-lg-12">
                <div class="col-lg-6">
                    <div class="form-group">
                        <?php $list = ArrayHelper::map(backend\models\Category::findAll(['status' => 1]), 'id', 'category'); ?>
---
SELECT * FROM `category` WHERE `status`=1